{
  "abstract": "Deeper neural networks are more difficult to train. We present a residual learning framework to ease the training of networks that are substantially deeper than those used previously. We explicitly reformulate the layers as learning residual functions with reference to the layer inputs, instead of learning unreferenced functions. We provide comprehensive empirical evidence showing that these residual networks are easier to optimize, and can gain accuracy from considerably increased depth. On the ImageNet dataset we evaluate residual nets with a depth of up to 152 layers—8$\\times$ deeper than VGG nets (See [Ref.[0] of ArXiv.1512.03385]) but still having lower complexity. An ensemble of these residual nets achieves 3.57% error on the ImageNet test set. This result won the 1st place on the ILSVRC 2015 classification task. We also present analysis on CIFAR-10 with 100 and 1000 layers. The depth of representations is of central importance for many visual recognition tasks. Solely due to our extremely deep representations, we obtain a 28% relative improvement on the COCO object detection dataset. Deep residual nets are foundations of our submissions to ILSVRC & COCO 2015 competitions[[[Notice: http://image-net.org/challenges/LSVRC/2015/ and http://mscoco.org/dataset/#detections-challenge2015 .]]] , where we also won the 1st places on the tasks of ImageNet detection, ImageNet localization, COCO detection, and COCO segmentation.",
  "acknowledge": "",
  "sections": [
    {
      "tag": "1",
      "section_title": "Introduction",
      "section_content": [
        [
          "Deep convolutional neural networks (See [Ref.[1,2] of ArXiv.1512.03385]) have led to a series of breakthroughs for image classification [Ref.[2,3,4] of ArXiv.1512.03385] . Deep networks naturally integrate low/mid/high-level features (See [Ref.[3] of ArXiv.1512.03385]) and classifiers in an end-to-end multi-layer fashion, and the “levels” of features can be enriched by the number of stacked layers (depth). Recent evidence (See [Ref.[0,5] of ArXiv.1512.03385]) reveals that network depth is of crucial importance, and the leading results (See [Ref.[0,5,6,7] of ArXiv.1512.03385]) on the challenging ImageNet dataset (See [Ref.[8] of ArXiv.1512.03385]) all exploit “very deep” (See [Ref.[0] of ArXiv.1512.03385]) models, with a depth of sixteen (See [Ref.[0] of ArXiv.1512.03385]) to thirty (See [Ref.[7] of ArXiv.1512.03385]) . Many other nontrivial visual recognition tasks (See [Ref.[9,10,11,12,13] of ArXiv.1512.03385]) have also greatly benefited from very deep models."
        ],
        [
          "Driven by the significance of depth, a question arises: Is learning better networks as easy as stacking more layers? An obstacle to answering this question was the notorious problem of vanishing/exploding gradients (See [Ref.[14,15] of ArXiv.1512.03385]) , which hamper convergence from the beginning. This problem, however, has been largely addressed by normalized initialization [Ref.[16,15,17,6] of ArXiv.1512.03385] and intermediate normalization layers (See [Ref.[7] of ArXiv.1512.03385]) , which enable networks with tens of layers to start converging for stochastic gradient descent (SGD) with backpropagation [Ref.[1] of ArXiv.1512.03385] ."
        ],
        [
          "When deeper networks are able to start converging, a degradation problem has been exposed: with the network depth increasing, accuracy gets saturated (which might be unsurprising) and then degrades rapidly. Unexpectedly, such degradation is not caused by overfitting , and adding more layers to a suitably deep model leads to higher training error , as reported in [Ref.[18,19] of ArXiv.1512.03385] and thoroughly verified by our experiments. [Figure.0 of ArXiv.1512.03385] shows a typical example."
        ],
        [
          "The degradation (of training accuracy) indicates that not all systems are similarly easy to optimize. Let us consider a shallower architecture and its deeper counterpart that adds more layers onto it. There exists a solution by construction to the deeper model: the added layers are identity mapping, and the other layers are copied from the learned shallower model. The existence of this constructed solution indicates that a deeper model should produce no higher training error than its shallower counterpart. But experiments show that our current solvers on hand are unable to find solutions that are comparably good or better than the constructed solution (or unable to do so in feasible time)."
        ],
        [
          "In this paper, we address the degradation problem by introducing a deep residual learning framework. Instead of hoping each few stacked layers directly fit a desired underlying mapping, we explicitly let these layers fit a residual mapping. Formally, denoting the desired underlying mapping as $\\mathcal{H}(\\mathbf{x})$, we let the stacked nonlinear layers fit another mapping of $\\mathcal{F}(\\mathbf{x}):=\\mathcal{H}(\\mathbf{x})-\\mathbf{x}$. The original mapping is recast into $\\mathcal{F}(\\mathbf{x})+\\mathbf{x}$. We hypothesize that it is easier to optimize the residual mapping than to optimize the original, unreferenced mapping. To the extreme, if an identity mapping were optimal, it would be easier to push the residual to zero than to fit an identity mapping by a stack of nonlinear layers."
        ],
        [
          "The formulation of $\\mathcal{F}(\\mathbf{x})+\\mathbf{x}$ can be realized by feedforward neural networks with “shortcut connections” ( [Figure.1 of ArXiv.1512.03385] ). Shortcut connections (See [Ref.[20,21,22] of ArXiv.1512.03385]) are those skipping one or more layers. In our case, the shortcut connections simply perform identity mapping, and their outputs are added to the outputs of the stacked layers [Figure.1 of ArXiv.1512.03385] . Identity shortcut connections add neither extra parameter nor computational complexity. The entire network can still be trained end-to-end by SGD with backpropagation, and can be easily implemented using common libraries (e.g ., Caffe (See [Ref.[23] of ArXiv.1512.03385]) ) without modifying the solvers."
        ],
        [
          "We present comprehensive experiments on ImageNet (See [Ref.[8] of ArXiv.1512.03385]) to show the degradation problem and evaluate our method. We show that: 1) Our extremely deep residual nets are easy to optimize, but the counterpart “plain” nets (that simply stack layers) exhibit higher training error when the depth increases; 2) Our deep residual nets can easily enjoy accuracy gains from greatly increased depth, producing results substantially better than previous networks."
        ],
        [
          "Similar phenomena are also shown on the CIFAR-10 set (See [Ref.[24] of ArXiv.1512.03385]) , suggesting that the optimization difficulties and the effects of our method are not just akin to a particular dataset. We present successfully trained models on this dataset with over 100 layers, and explore models with over 1000 layers."
        ],
        [
          "On the ImageNet classification dataset (See [Ref.[8] of ArXiv.1512.03385]) , we obtain excellent results by extremely deep residual nets. Our 152-layer residual net is the deepest network ever presented on ImageNet, while still having lower complexity than VGG nets (See [Ref.[0] of ArXiv.1512.03385]) . Our ensemble has **3.57%** top-5 error on the ImageNet test set, and won the 1st place in the ILSVRC 2015 classification competition . The extremely deep representations also have excellent generalization performance on other recognition tasks, and lead us to further win the 1st places on: ImageNet detection, ImageNet localization, COCO detection, and COCO segmentation in ILSVRC & COCO 2015 competitions. This strong evidence shows that the residual learning principle is generic, and we expect that it is applicable in other vision and non-vision problems."
        ]
      ]
    },
    {
      "tag": "2",
      "section_title": "Related Work",
      "section_content": [
        [
          "**Residual Representations.** In image recognition, VLAD (See [Ref.[25] of ArXiv.1512.03385]) is a representation that encodes by the residual vectors with respect to a dictionary, and Fisher Vector [Ref.[26] of ArXiv.1512.03385] can be formulated as a probabilistic version [Ref.[25] of ArXiv.1512.03385] of VLAD. Both of them are powerful shallow representations for image retrieval and classification [Ref.[27,28] of ArXiv.1512.03385] . For vector quantization, encoding residual vectors (See [Ref.[29] of ArXiv.1512.03385]) is shown to be more effective than encoding original vectors."
        ],
        [
          "In low-level vision and computer graphics, for solving Partial Differential Equations (PDEs), the widely used Multigrid method (See [Ref.[30] of ArXiv.1512.03385]) reformulates the system as subproblems at multiple scales, where each subproblem is responsible for the residual solution between a coarser and a finer scale. An alternative to Multigrid is hierarchical basis preconditioning (See [Ref.[31,32] of ArXiv.1512.03385]) , which relies on variables that represent residual vectors between two scales. It has been shown (See [Ref.[30,31,32] of ArXiv.1512.03385]) that these solvers converge much faster than standard solvers that are unaware of the residual nature of the solutions. These methods suggest that a good reformulation or preconditioning can simplify the optimization."
        ],
        [
          "**Shortcut Connections.** Practices and theories that lead to shortcut connections (See [Ref.[20,21,22] of ArXiv.1512.03385]) have been studied for a long time. An early practice of training multi-layer perceptrons (MLPs) is to add a linear layer connected from the network input to the output (See [Ref.[21,22] of ArXiv.1512.03385]) . In (See [Ref.[5,33] of ArXiv.1512.03385]) , a few intermediate layers are directly connected to auxiliary classifiers for addressing vanishing/exploding gradients. The papers of (See [Ref.[34,35,36,37] of ArXiv.1512.03385]) propose methods for centering layer responses, gradients, and propagated errors, implemented by shortcut connections. In (See [Ref.[5] of ArXiv.1512.03385]) , an “inception” layer is composed of a shortcut branch and a few deeper branches."
        ],
        [
          "Concurrent with our work, “highway networks” (See [Ref.[19,38] of ArXiv.1512.03385]) present shortcut connections with gating functions (See [Ref.[39] of ArXiv.1512.03385]) . These gates are data-dependent and have parameters, in contrast to our identity shortcuts that are parameter-free. When a gated shortcut is “closed” (approaching zero), the layers in highway networks represent non-residual functions. On the contrary, our formulation always learns residual functions; our identity shortcuts are never closed, and all information is always passed through, with additional residual functions to be learned. In addition, highway networks have not demonstrated accuracy gains with extremely increased depth (e.g ., over 100 layers)."
        ]
      ]
    },
    {
      "tag": "3",
      "section_title": "Deep Residual Learning",
      "section_content": [
        [
          "Let us consider $\\mathcal{H}(\\mathbf{x})$ as an underlying mapping to be fit by a few stacked layers (not necessarily the entire net), with $\\mathbf{x}$ denoting the inputs to the first of these layers. If one hypothesizes that multiple nonlinear layers can asymptotically approximate complicated functions[[[Notice: (See [Ref.[40] of ArXiv.1512.03385]) .]]] , then it is equivalent to hypothesize that they can asymptotically approximate the residual functions, i.e ., $\\mathcal{H}(\\mathbf{x})-\\mathbf{x}$ (assuming that the input and output are of the same dimensions). So rather than expect stacked layers to approximate $\\mathcal{H}(\\mathbf{x})$, we explicitly let these layers approximate a residual function $\\mathcal{F}(\\mathbf{x}):=\\mathcal{H}(\\mathbf{x})-\\mathbf{x}$. The original function thus becomes $\\mathcal{F}(\\mathbf{x})+\\mathbf{x}$. Although both forms should be able to asymptotically approximate the desired functions (as hypothesized), the ease of learning might be different."
        ],
        [
          "This reformulation is motivated by the counterintuitive phenomena about the degradation problem ( [Figure.0 of ArXiv.1512.03385] , left). As we discussed in the introduction, if the added layers can be constructed as identity mappings, a deeper model should have training error no greater than its shallower counterpart. The degradation problem suggests that the solvers might have difficulties in approximating identity mappings by multiple nonlinear layers. With the residual learning reformulation, if identity mappings are optimal, the solvers may simply drive the weights of the multiple nonlinear layers toward zero to approach identity mappings."
        ],
        [
          "In real cases, it is unlikely that identity mappings are optimal, but our reformulation may help to precondition the problem. If the optimal function is closer to an identity mapping than to a zero mapping, it should be easier for the solver to find the perturbations with reference to an identity mapping, than to learn the function as a new one. We show by experiments ( [Figure.6 of ArXiv.1512.03385] ) that the learned residual functions in general have small responses, suggesting that identity mappings provide reasonable preconditioning."
        ],
        [
          "We adopt residual learning to every few stacked layers. A building block is shown in [Figure.1 of ArXiv.1512.03385] . Formally, in this paper we consider a building block defined as:",
          "$$\\mathbf{y}=\\mathcal{F}(\\mathbf{x},\\{W_{i}\\})+\\mathbf{x}.$$",
          "Here $\\mathbf{x}$ and $\\mathbf{y}$ are the input and output vectors of the layers considered. The function $\\mathcal{F}(\\mathbf{x},\\{W_{i}\\})$ represents the residual mapping to be learned. For the example in [Figure.1 of ArXiv.1512.03385] that has two layers, $\\mathcal{F}=W_{2}\\sigma(W_{1}\\mathbf{x})$ in which $\\sigma$ denotes ReLU (See [Ref.[41] of ArXiv.1512.03385]) and the biases are omitted for simplifying notations. The operation $\\mathcal{F}+\\mathbf{x}$ is performed by a shortcut connection and element-wise addition. We adopt the second nonlinearity after the addition (i.e , $\\sigma(\\mathbf{y})$, see [Figure.1 of ArXiv.1512.03385] )."
        ],
        [
          "The shortcut connections in Eqn. [Equation.0 of ArXiv.1512.03385] introduce neither extra parameter nor computation complexity. This is not only attractive in practice but also important in our comparisons between plain and residual networks. We can fairly compare plain/residual networks that simultaneously have the same number of parameters, depth, width, and computational cost (except for the negligible element-wise addition)."
        ],
        [
          "The dimensions of $\\mathbf{x}$ and $\\mathcal{F}$ must be equal in Eqn. [Equation.0 of ArXiv.1512.03385] . If this is not the case (e.g ., when changing the input/output channels), we can perform a linear projection $W_{s}$ by the shortcut connections to match the dimensions:",
          "$$\\mathbf{y}=\\mathcal{F}(\\mathbf{x},\\{W_{i}\\})+W_{s}\\mathbf{x}.$$",
          "We can also use a square matrix $W_{s}$ in Eqn. [Equation.0 of ArXiv.1512.03385] . But we will show by experiments that the identity mapping is sufficient for addressing the degradation problem and is economical, and thus $W_{s}$ is only used when matching dimensions."
        ],
        [
          "The form of the residual function $\\mathcal{F}$ is flexible. Experiments in this paper involve a function $\\mathcal{F}$ that has two or three layers ( [Figure.4 of ArXiv.1512.03385] ), while more layers are possible. But if $\\mathcal{F}$ has only a single layer, Eqn. [Equation.0 of ArXiv.1512.03385] is similar to a linear layer: $\\mathbf{y}=W_{1}\\mathbf{x}+\\mathbf{x}$, for which we have not observed advantages."
        ],
        [
          "We also note that although the above notations are about fully-connected layers for simplicity, they are applicable to convolutional layers. The function $\\mathcal{F}(\\mathbf{x},\\{W_{i}\\})$ can represent multiple convolutional layers. The element-wise addition is performed on two feature maps, channel by channel."
        ],
        [
          "We have tested various plain/residual nets, and have observed consistent phenomena. To provide instances for discussion, we describe two models for ImageNet as follows."
        ],
        [
          "**Plain Network.** Our plain baselines ( [Figure.2 of ArXiv.1512.03385] , middle) are mainly inspired by the philosophy of VGG nets (See [Ref.[0] of ArXiv.1512.03385]) ( [Figure.2 of ArXiv.1512.03385] , left). The convolutional layers mostly have 3$\\times$3 filters and follow two simple design rules: (i) for the same output feature map size, the layers have the same number of filters; and (ii) if the feature map size is halved, the number of filters is doubled so as to preserve the time complexity per layer. We perform downsampling directly by convolutional layers that have a stride of 2. The network ends with a global average pooling layer and a 1000-way fully-connected layer with softmax. The total number of weighted layers is 34 in [Figure.2 of ArXiv.1512.03385] (middle)."
        ],
        [
          "It is worth noticing that our model has fewer filters and lower complexity than VGG nets (See [Ref.[0] of ArXiv.1512.03385]) ( [Figure.2 of ArXiv.1512.03385] , left). Our 34-layer baseline has 3.6 billion FLOPs (multiply-adds), which is only 18% of VGG-19 (19.6 billion FLOPs)."
        ],
        [
          "**Residual Network.** Based on the above plain network, we insert shortcut connections ( [Figure.2 of ArXiv.1512.03385] , right) which turn the network into its counterpart residual version. The identity shortcuts (Eqn. [Equation.0 of ArXiv.1512.03385] ) can be directly used when the input and output are of the same dimensions (solid line shortcuts in [Figure.2 of ArXiv.1512.03385] ). When the dimensions increase (dotted line shortcuts in [Figure.2 of ArXiv.1512.03385] ), we consider two options: (A) The shortcut still performs identity mapping, with extra zero entries padded for increasing dimensions. This option introduces no extra parameter; (B) The projection shortcut in Eqn. [Equation.1 of ArXiv.1512.03385] is used to match dimensions (done by 1$\\times$1 convolutions). For both options, when the shortcuts go across feature maps of two sizes, they are performed with a stride of 2."
        ],
        [
          "Our implementation for ImageNet follows the practice in [Ref.[2,0] of ArXiv.1512.03385] . The image is resized with its shorter side randomly sampled in $[256,480]$ for scale augmentation [Ref.[0] of ArXiv.1512.03385] . A 224$\\times$224 crop is randomly sampled from an image or its horizontal flip, with the per-pixel mean subtracted (See [Ref.[2] of ArXiv.1512.03385]) . The standard color augmentation in [Ref.[2] of ArXiv.1512.03385] is used. We adopt batch normalization (BN) (See [Ref.[7] of ArXiv.1512.03385]) right after each convolution and before activation, following (See [Ref.[7] of ArXiv.1512.03385]) . We initialize the weights as in [Ref.[6] of ArXiv.1512.03385] and train all plain/residual nets from scratch. We use SGD with a mini-batch size of 256. The learning rate starts from 0.1 and is divided by 10 when the error plateaus, and the models are trained for up to $60\\times 10^{4}$ iterations. We use a weight decay of 0.0001 and a momentum of 0.9. We do not use dropout [Ref.[42] of ArXiv.1512.03385] , following the practice in [Ref.[7] of ArXiv.1512.03385] ."
        ],
        [
          "In testing, for comparison studies we adopt the standard 10-crop testing (See [Ref.[2] of ArXiv.1512.03385]) . For best results, we adopt the fully-convolutional form as in [Ref.[0,6] of ArXiv.1512.03385] , and average the scores at multiple scales (images are resized such that the shorter side is in $\\{224,256,384,480,640\\}$)."
        ]
      ]
    },
    {
      "tag": "4",
      "section_title": "Experiments",
      "section_content": [
        [
          "We evaluate our method on the ImageNet 2012 classification dataset (See [Ref.[8] of ArXiv.1512.03385]) that consists of 1000 classes. The models are trained on the 1.28 million training images, and evaluated on the 50k validation images. We also obtain a final result on the 100k test images, reported by the test server. We evaluate both top-1 and top-5 error rates."
        ],
        [
          "**Plain Networks.** We first evaluate 18-layer and 34-layer plain nets. The 34-layer plain net is in [Figure.2 of ArXiv.1512.03385] (middle). The 18-layer plain net is of a similar form. See [Table.7 of ArXiv.1512.03385] for detailed architectures."
        ],
        [
          "The results in [Table.0 of ArXiv.1512.03385] show that the deeper 34-layer plain net has higher validation error than the shallower 18-layer plain net. To reveal the reasons, in [Figure.3 of ArXiv.1512.03385] (left) we compare their training/validation errors during the training procedure. We have observed the degradation problem - the 34-layer plain net has higher training error throughout the whole training procedure, even though the solution space of the 18-layer plain network is a subspace of that of the 34-layer one."
        ],
        [
          "We argue that this optimization difficulty is unlikely to be caused by vanishing gradients. These plain networks are trained with BN (See [Ref.[7] of ArXiv.1512.03385]) , which ensures forward propagated signals to have non-zero variances. We also verify that the backward propagated gradients exhibit healthy norms with BN. So neither forward nor backward signals vanish. In fact, the 34-layer plain net is still able to achieve competitive accuracy [Table.5 of ArXiv.1512.03385] , suggesting that the solver works to some extent. We conjecture that the deep plain nets may have exponentially low convergence rates, which impact the reducing of the training error[[[Notice: $\\times$) and still observed the degradation problem, suggesting that this problem cannot be feasibly addressed by simply using more iterations.]]] . The reason for such optimization difficulties will be studied in the future."
        ],
        [
          "**Residual Networks.** Next we evaluate 18-layer and 34-layer residual nets (ResNets ). The baseline architectures are the same as the above plain nets, expect that a shortcut connection is added to each pair of 3$\\times$3 filters as in [Figure.2 of ArXiv.1512.03385] (right). In the first comparison ( [Table.0 of ArXiv.1512.03385] and [Figure.3 of ArXiv.1512.03385] right), we use identity mapping for all shortcuts and zero-padding for increasing dimensions (option A). So they have no extra parameter compared to the plain counterparts."
        ],
        [
          "We have three major observations from [Table.0 of ArXiv.1512.03385] and [Figure.3 of ArXiv.1512.03385] . First, the situation is reversed with residual learning – the 34-layer ResNet is better than the 18-layer ResNet (by 2.8%). More importantly, the 34-layer ResNet exhibits considerably lower training error and is generalizable to the validation data. This indicates that the degradation problem is well addressed in this setting and we manage to obtain accuracy gains from increased depth."
        ],
        [
          "Second, compared to its plain counterpart, the 34-layer ResNet reduces the top-1 error by 3.5% ( [Table.0 of ArXiv.1512.03385] ), resulting from the successfully reduced training error ( [Figure.3 of ArXiv.1512.03385] right vs . left). This comparison verifies the effectiveness of residual learning on extremely deep systems."
        ],
        [
          "Last, we also note that the 18-layer plain/residual nets are comparably accurate ( [Table.0 of ArXiv.1512.03385] ), but the 18-layer ResNet converges faster ( [Figure.3 of ArXiv.1512.03385] right vs . left). When the net is “not overly deep” (18 layers here), the current SGD solver is still able to find good solutions to the plain net. In this case, the ResNet eases the optimization by providing faster convergence at the early stage."
        ],
        [
          "**Identity ** We have shown that parameter-free, identity shortcuts help with training. Next we investigate projection shortcuts (Eqn. [Equation.1 of ArXiv.1512.03385] ). In [Table.5 of ArXiv.1512.03385] we compare three options: (A) zero-padding shortcuts are used for increasing dimensions, and all shortcuts are parameter-free (the same as [Table.0 of ArXiv.1512.03385] and [Figure.3 of ArXiv.1512.03385] right); (B) projection shortcuts are used for increasing dimensions, and other shortcuts are identity; and (C) all shortcuts are projections."
        ],
        [
          "[Table.5 of ArXiv.1512.03385] shows that all three options are considerably better than the plain counterpart. B is slightly better than A. We argue that this is because the zero-padded dimensions in A indeed have no residual learning. C is marginally better than B, and we attribute this to the extra parameters introduced by many (thirteen) projection shortcuts. But the small differences among A/B/C indicate that projection shortcuts are not essential for addressing the degradation problem. So we do not use option C in the rest of this paper, to reduce memory/time complexity and model sizes. Identity shortcuts are particularly important for not increasing the complexity of the bottleneck architectures that are introduced below."
        ],
        [
          "**Deeper Bottleneck Architectures.** Next we describe our deeper nets for ImageNet. Because of concerns on the training time that we can afford, we modify the building block as a bottleneck design[[[Notice: non -bottleneck ResNets (e.g , [Figure.4 of ArXiv.1512.03385] left) also gain accuracy from increased depth (as shown on CIFAR-10), but are not as economical as the bottleneck ResNets. So the usage of bottleneck designs is mainly due to practical considerations. We further note that the degradation problem of plain nets is also witnessed for the bottleneck designs.]]] . For each residual function $\\mathcal{F}$, we use a stack of 3 layers instead of 2 [Figure.4 of ArXiv.1512.03385] . The three layers are 1$\\times$1, 3$\\times$3, and 1$\\times$1 convolutions, where the 1$\\times$1 layers are responsible for reducing and then increasing (restoring) dimensions, leaving the 3$\\times$3 layer a bottleneck with smaller input/output dimensions. [Figure.4 of ArXiv.1512.03385] shows an example, where both designs have similar time complexity."
        ],
        [
          "The parameter-free identity shortcuts are particularly important for the bottleneck architectures. If the identity shortcut in [Figure.4 of ArXiv.1512.03385] (right) is replaced with projection, one can show that the time complexity and model size are doubled, as the shortcut is connected to the two high-dimensional ends. So identity shortcuts lead to more efficient models for the bottleneck designs."
        ],
        [
          "**50-layer ResNet:** We replace each 2-layer block in the 34-layer net with this 3-layer bottleneck block, resulting in a 50-layer ResNet [Table.7 of ArXiv.1512.03385] . We use option B for increasing dimensions. This model has 3.8 billion FLOPs."
        ],
        [
          "**101-layer and 152-layer ResNets:** We construct 101-layer and 152-layer ResNets by using more 3-layer blocks [Table.7 of ArXiv.1512.03385] . Remarkably, although the depth is significantly increased, the 152-layer ResNet (11.3 billion FLOPs) still has lower complexity than VGG-16/19 nets (15.3/19.6 billion FLOPs)."
        ],
        [
          "The 50/101/152-layer ResNets are more accurate than the 34-layer ones by considerable margins ( [Table.5 of ArXiv.1512.03385] and (See [Missing.9 of ArXiv.1512.03385]) ). We do not observe the degradation problem and thus enjoy significant accuracy gains from considerably increased depth. The benefits of depth are witnessed for all evaluation metrics ( [Table.5 of ArXiv.1512.03385] and (See [Missing.9 of ArXiv.1512.03385]) )."
        ],
        [
          "**Comparisons with State-of-the-art Methods.** In [Table.9 of ArXiv.1512.03385] we compare with the previous best single-model results. Our baseline 34-layer ResNets have achieved very competitive accuracy. Our 152-layer ResNet has a single-model top-5 validation error of 4.49%. This single-model result outperforms all previous ensemble results [Table.2 of ArXiv.1512.03385] . We combine six models of different depth to form an ensemble (only with two 152-layer ones at the time of submitting). This leads to **3.57%** top-5 error on the test set [Table.2 of ArXiv.1512.03385] . This entry won the 1st place in ILSVRC 2015."
        ],
        [
          "We conducted more studies on the CIFAR-10 dataset (See [Ref.[24] of ArXiv.1512.03385]) , which consists of 50k training images and 10k testing images in 10 classes. We present experiments trained on the training set and evaluated on the test set. Our focus is on the behaviors of extremely deep networks, but not on pushing the state-of-the-art results, so we intentionally use simple architectures as follows."
        ],
        [
          "The plain/residual architectures follow the form in [Figure.2 of ArXiv.1512.03385] (middle/right). The network inputs are 32$\\times$32 images, with the per-pixel mean subtracted. The first layer is 3$\\times$3 convolutions. Then we use a stack of $6n$ layers with 3$\\times$3 convolutions on the feature maps of sizes $\\{32,16,8\\}$ respectively, with 2$n$ layers for each feature map size. The numbers of filters are $\\{16,32,64\\}$ respectively. The subsampling is performed by convolutions with a stride of 2. The network ends with a global average pooling, a 10-way fully-connected layer, and softmax. There are totally 6$n$+2 stacked weighted layers. The following table summarizes the architecture:",
          "When shortcut connections are used, they are connected to the pairs of 3$\\times$3 layers (totally $3n$ shortcuts). On this dataset we use identity shortcuts in all cases (i.e ., option A), so our residual models have exactly the same depth, width, and number of parameters as the plain counterparts."
        ],
        [
          "We use a weight decay of 0.0001 and momentum of 0.9, and adopt the weight initialization in [Ref.[6] of ArXiv.1512.03385] and BN (See [Ref.[7] of ArXiv.1512.03385]) but with no dropout. These models are trained with a mini-batch size of 128 on two GPUs. We start with a learning rate of 0.1, divide it by 10 at 32k and 48k iterations, and terminate training at 64k iterations, which is determined on a 45k/5k train/val split. We follow the simple data augmentation in [Ref.[33] of ArXiv.1512.03385] for training: 4 pixels are padded on each side, and a 32$\\times$32 crop is randomly sampled from the padded image or its horizontal flip. For testing, we only evaluate the single view of the original 32$\\times$32 image."
        ],
        [
          "We compare $n=\\{3,5,7,9\\}$, leading to 20, 32, 44, and 56-layer networks. [Figure.5 of ArXiv.1512.03385] (left) shows the behaviors of the plain nets. The deep plain nets suffer from increased depth, and exhibit higher training error when going deeper. This phenomenon is similar to that on ImageNet ( [Figure.3 of ArXiv.1512.03385] , left) and on MNIST (see [Ref.[19] of ArXiv.1512.03385] ), suggesting that such an optimization difficulty is a fundamental problem."
        ],
        [
          "[Figure.5 of ArXiv.1512.03385] (middle) shows the behaviors of ResNets. Also similar to the ImageNet cases ( [Figure.3 of ArXiv.1512.03385] , right), our ResNets manage to overcome the optimization difficulty and demonstrate accuracy gains when the depth increases."
        ],
        [
          "We further explore $n=18$ that leads to a 110-layer ResNet. In this case, we find that the initial learning rate of 0.1 is slightly too large to start converging[[[Notice: $<$90% error) after several epochs, but still reaches similar accuracy.]]] . So we use 0.01 to warm up the training until the training error is below 80% (about 400 iterations), and then go back to 0.1 and continue training. The rest of the learning schedule is as done previously. This 110-layer network converges well ( [Figure.5 of ArXiv.1512.03385] , middle). It has fewer parameters than other deep and thin networks such as FitNet (See [Ref.[43] of ArXiv.1512.03385]) and Highway (See [Ref.[19] of ArXiv.1512.03385]) [Table.12 of ArXiv.1512.03385] , yet is among the state-of-the-art results (6.43%, [Table.12 of ArXiv.1512.03385] )."
        ],
        [
          "**Analysis of Layer Responses.** [Figure.6 of ArXiv.1512.03385] shows the standard deviations (std) of the layer responses. The responses are the outputs of each 3$\\times$3 layer, after BN and before other nonlinearity (ReLU/addition). For ResNets, this analysis reveals the response strength of the residual functions. [Figure.6 of ArXiv.1512.03385] shows that ResNets have generally smaller responses than their plain counterparts. These results support our basic motivation [Section.0 of ArXiv.1512.03385] that the residual functions might be generally closer to zero than the non-residual functions. We also notice that the deeper ResNet has smaller magnitudes of responses, as evidenced by the comparisons among ResNet-20, 56, and 110 in [Figure.6 of ArXiv.1512.03385] . When there are more layers, an individual layer of ResNets tends to modify the signal less."
        ],
        [
          "**Exploring Over 1000 layers.** We explore an aggressively deep model of over 1000 layers. We set $n=200$ that leads to a 1202-layer network, which is trained as described above. Our method shows no optimization difficulty , and this $10^{3}$-layer network is able to achieve training error $<$0.1% ( [Figure.5 of ArXiv.1512.03385] , right). Its test error is still fairly good (7.93%, [Table.12 of ArXiv.1512.03385] )."
        ],
        [
          "But there are still open problems on such aggressively deep models. The testing result of this 1202-layer network is worse than that of our 110-layer network, although both have similar training error. We argue that this is because of overfitting. The 1202-layer network may be unnecessarily large (19.4M) for this small dataset. Strong regularization such as maxout [Ref.[44] of ArXiv.1512.03385] or dropout [Ref.[42] of ArXiv.1512.03385] is applied to obtain the best results (See [Ref.[44,45,33,43] of ArXiv.1512.03385]) on this dataset. In this paper, we use no maxout/dropout and just simply impose regularization via deep and thin architectures by design, without distracting from the focus on the difficulties of optimization. But combining with stronger regularization may improve results, which we will study in the future."
        ],
        [
          "Our method has good generalization performance on other recognition tasks. [Table.4 of ArXiv.1512.03385] and (See [Missing.8 of ArXiv.1512.03385]) show the object detection baseline results on PASCAL VOC 2007 and 2012 (See [Ref.[46] of ArXiv.1512.03385]) and COCO (See [Ref.[47] of ArXiv.1512.03385]) . We adopt Faster R-CNN (See [Ref.[12] of ArXiv.1512.03385]) as the detection method. Here we are interested in the improvements of replacing VGG-16 (See [Ref.[0] of ArXiv.1512.03385]) with ResNet-101. The detection implementation (see appendix) of using both models is the same, so the gains can only be attributed to better networks. Most remarkably, on the challenging COCO dataset we obtain a 6.0% increase in COCO’s standard metric (mAP@[.5, .95]), which is a 28% relative improvement. This gain is solely due to the learned representations."
        ],
        [
          "Based on deep residual nets, we won the 1st places in several tracks in ILSVRC & COCO 2015 competitions: ImageNet detection, ImageNet localization, COCO detection, and COCO segmentation. The details are in the appendix."
        ]
      ]
    }
  ],
  "appendix": [
    {
      "tag": "Appendix A",
      "section_title": "Object Detection Baselines",
      "section_content": [
        [
          "In this section we introduce our detection method based on the baseline Faster R-CNN (See [Ref.[12] of ArXiv.1512.03385]) system. The models are initialized by the ImageNet classification models, and then fine-tuned on the object detection data. We have experimented with ResNet-50/101 at the time of the ILSVRC & COCO 2015 detection competitions."
        ],
        [
          "Unlike VGG-16 used in [Ref.[12] of ArXiv.1512.03385] , our ResNet has no hidden fc layers. We adopt the idea of “Networks on Conv feature maps” (NoC) (See [Ref.[48] of ArXiv.1512.03385]) to address this issue. We compute the full-image shared conv feature maps using those layers whose strides on the image are no greater than 16 pixels (i.e , conv1, conv2_ x, conv3_x, and conv4_x, totally 91 conv layers in ResNet-101; [Table.7 of ArXiv.1512.03385] ). We consider these layers as analogous to the 13 conv layers in VGG-16, and by doing so, both ResNet and VGG-16 have conv feature maps of the same total stride (16 pixels). These layers are shared by a region proposal network (RPN, generating 300 proposals) (See [Ref.[12] of ArXiv.1512.03385]) and a Fast R-CNN detection network (See [Ref.[11] of ArXiv.1512.03385]) . RoI pooling (See [Ref.[11] of ArXiv.1512.03385]) is performed before conv5_1. On this RoI-pooled feature, all layers of conv5_x and up are adopted for each region, playing the roles of VGG-16’s fc layers. The final classification layer is replaced by two sibling layers (classification and box regression [Ref.[11] of ArXiv.1512.03385] )."
        ],
        [
          "For the usage of BN layers, after pre-training, we compute the BN statistics (means and variances) for each layer on the ImageNet training set. Then the BN layers are fixed during fine-tuning for object detection. As such, the BN layers become linear activations with constant offsets and scales, and BN statistics are not updated by fine-tuning. We fix the BN layers mainly for reducing memory consumption in Faster R-CNN training."
        ],
        [
          "**PASCAL VOC**"
        ],
        [
          "Following (See [Ref.[11,12] of ArXiv.1512.03385]) , for the PASCAL VOC 2007 test set, we use the 5k trainval images in VOC 2007 and 16k trainval images in VOC 2012 for training (“07+12”). For the PASCAL VOC 2012 test set, we use the 10k trainval +test images in VOC 2007 and 16k trainval images in VOC 2012 for training (“07++12”). The hyper-parameters for training Faster R-CNN are the same as in [Ref.[12] of ArXiv.1512.03385] [Table.4 of ArXiv.1512.03385] shows the results. ResNet-101 improves the mAP by $>$3% over VGG-16. This gain is solely because of the improved features learned by ResNet."
        ],
        [
          "**MS COCO**"
        ],
        [
          "The MS COCO dataset (See [Ref.[47] of ArXiv.1512.03385]) involves 80 object categories. We evaluate the PASCAL VOC metric (mAP @ IoU = 0.5) and the standard COCO metric (mAP @ IoU = .5:.05:.95). We use the 80k images on the train set for training and the 40k images on the val set for evaluation. Our detection system for COCO is similar to that for PASCAL VOC. We train the COCO models with an 8-GPU implementation, and thus the RPN step has a mini-batch size of 8 images (i.e ., 1 per GPU) and the Fast R-CNN step has a mini-batch size of 16 images. The RPN step and Fast R-CNN step are both trained for 240k iterations with a learning rate of 0.001 and then for 80k iterations with 0.0001."
        ],
        [
          "[Table.8 of ArXiv.1512.03385] shows the results on the MS COCO validation set. ResNet-101 has a 6% increase of mAP@[.5, .95] over VGG-16, which is a 28% relative improvement, solely contributed by the features learned by the better network. Remarkably, the mAP@[.5, .95]’s absolute increase (6.0%) is nearly as big as mAP@.5’s (6.9%). This suggests that a deeper network can improve both recognition and localization."
        ]
      ]
    },
    {
      "tag": "Appendix B",
      "section_title": "Object Detection Improvements",
      "section_content": [
        [
          "For completeness, we report the improvements made for the competitions. These improvements are based on deep features and thus should benefit from residual learning."
        ],
        [
          "**MS COCO**"
        ],
        [
          "Box refinement. Our box refinement partially follows the iterative localization in [Ref.[49] of ArXiv.1512.03385] . In Faster R-CNN, the final output is a regressed box that is different from its proposal box. So for inference, we pool a new feature from the regressed box and obtain a new classification score and a new regressed box. We combine these 300 new predictions with the original 300 predictions. Non-maximum suppression (NMS) is applied on the union set of predicted boxes using an IoU threshold of 0.3 (See [Ref.[9] of ArXiv.1512.03385]) , followed by box voting (See [Ref.[49] of ArXiv.1512.03385]). Box refinement improves mAP by about 2 points [Table.11 of ArXiv.1512.03385] ."
        ],
        [
          "Global context. We combine global context in the Fast R-CNN step. Given the full-image conv feature map, we pool a feature by global Spatial Pyramid Pooling (See [Ref.[10] of ArXiv.1512.03385]) (with a “single-level” pyramid) which can be implemented as “RoI” pooling using the entire image’s bounding box as the RoI. This pooled feature is fed into the post-RoI layers to obtain a global context feature. This global feature is concatenated with the original per-region feature, followed by the sibling classification and box regression layers. This new structure is trained end-to-end. Global context improves mAP@.5 by about 1 point [Table.11 of ArXiv.1512.03385] ."
        ],
        [
          "Multi-scale testing. In the above, all results are obtained by single-scale training/testing as in [Ref.[12] of ArXiv.1512.03385] , where the image’s shorter side is $s=600$ pixels. Multi-scale training/testing has been developed in [Ref.[10,11] of ArXiv.1512.03385] by selecting a scale from a feature pyramid, and in [Ref.[48] of ArXiv.1512.03385] by using maxout layers. In our current implementation, we have performed multi-scale testing following (See [Ref.[48] of ArXiv.1512.03385]) ; we have not performed multi-scale training because of limited time. In addition, we have performed multi-scale testing only for the Fast R-CNN step (but not yet for the RPN step). With a trained model, we compute conv feature maps on an image pyramid, where the image’s shorter sides are $s\\in\\{200,400,600,800,1000\\}$. We select two adjacent scales from the pyramid following (See [Ref.[48] of ArXiv.1512.03385]) . RoI pooling and subsequent layers are performed on the feature maps of these two scales (See [Ref.[48] of ArXiv.1512.03385]) , which are merged by maxout as in [Ref.[48] of ArXiv.1512.03385]. Multi-scale testing improves the mAP by over 2 points [Table.11 of ArXiv.1512.03385] ."
        ],
        [
          "Using validation data. Next we use the 80k+40k trainval set for training and the 20k test-dev set for evaluation. The test-dev set has no publicly available ground truth and the result is reported by the evaluation server. Under this setting, the results are an mAP@.5 of 55.7% and an mAP@[.5, .95] of 34.9% [Table.11 of ArXiv.1512.03385] . This is our single-model result."
        ],
        [
          "Ensemble. In Faster R-CNN, the system is designed to learn region proposals and also object classifiers, so an ensemble can be used to boost both tasks. We use an ensemble for proposing regions, and the union set of proposals are processed by an ensemble of per-region classifiers. [Table.11 of ArXiv.1512.03385] shows our result based on an ensemble of 3 networks. The mAP is 59.0% and 37.4% on the test-dev set. This result won the 1st place in the detection task in COCO 2015."
        ],
        [
          "**PASCAL VOC**"
        ],
        [
          "We revisit the PASCAL VOC dataset based on the above model. With the single model on the COCO dataset (55.7% mAP@.5 in [Table.11 of ArXiv.1512.03385] ), we fine-tune this model on the PASCAL VOC sets. The improvements of box refinement, context, and multi-scale testing are also adopted. By doing so we achieve 85.6% mAP on PASCAL VOC 2007 ( [Table.13 of ArXiv.1512.03385] ) and 83.8% on PASCAL VOC 2012 ( [Table.6 of ArXiv.1512.03385] )[[[Notice: http://host.robots.ox.ac.uk:8080/anonymous/3OJ4OJ.html , submitted on 2015-11-26.]]] . The result on PASCAL VOC 2012 is 10 points higher than the previous state-of-the-art result (See [Ref.[49] of ArXiv.1512.03385]) ."
        ],
        [
          "**ImageNet Detection**"
        ],
        [
          "The ImageNet Detection (DET) task involves 200 object categories. The accuracy is evaluated by mAP@.5. Our object detection algorithm for ImageNet DET is the same as that for MS COCO in [Table.11 of ArXiv.1512.03385] . The networks are pre-trained on the 1000-class ImageNet classification set, and are fine-tuned on the DET data. We split the validation set into two parts (val1/val2) following (See [Ref.[9] of ArXiv.1512.03385]). We fine-tune the detection models using the DET training set and the val1 set. The val2 set is used for validation. We do not use other ILSVRC 2015 data. Our single model with ResNet-101 has 58.8% mAP and our ensemble of 3 models has 62.1% mAP on the DET test set [Table.1 of ArXiv.1512.03385] . This result won the 1st place in the ImageNet detection task in ILSVRC 2015 , surpassing the second place by **8.5 points** (absolute)."
        ]
      ]
    },
    {
      "tag": "Appendix C",
      "section_title": "ImageNet Localization",
      "section_content": [
        [
          "The ImageNet Localization (LOC) task (See [Ref.[8] of ArXiv.1512.03385]) requires to classify and localize the objects. Following (See [Ref.[4,0] of ArXiv.1512.03385]) , we assume that the image-level classifiers are first adopted for predicting the class labels of an image, and the localization algorithm only accounts for predicting bounding boxes based on the predicted classes. We adopt the “per-class regression” (PCR) strategy (See [Ref.[4,0] of ArXiv.1512.03385]) , learning a bounding box regressor for each class. We pre-train the networks for ImageNet classification and then fine-tune them for localization. We train networks on the provided 1000-class ImageNet training set."
        ],
        [
          "Our localization algorithm is based on the RPN framework of (See [Ref.[12] of ArXiv.1512.03385]) with a few modifications. Unlike the way in [Ref.[12] of ArXiv.1512.03385] that is category-agnostic, our RPN for localization is designed in a per-class form. This RPN ends with two sibling 1$\\times$1 convolutional layers for binary classification (cls ) and box regression (reg ), as in [Ref.[12] of ArXiv.1512.03385] . The cls and reg layers are both in a per-class from, in contrast to (See [Ref.[12] of ArXiv.1512.03385]) . Specifically, the cls layer has a 1000-d output, and each dimension is binary logistic regression for predicting being or not being an object class; the reg layer has a 1000$\\times$4-d output consisting of box regressors for 1000 classes. As in [Ref.[12] of ArXiv.1512.03385] , our bounding box regression is with reference to multiple translation-invariant “anchor” boxes at each position."
        ],
        [
          "As in our ImageNet classification training ( [Section.1 of ArXiv.1512.03385] ), we randomly sample 224$\\times$224 crops for data augmentation. We use a mini-batch size of 256 images for fine-tuning. To avoid negative samples being dominate, 8 anchors are randomly sampled for each image, where the sampled positive and negative anchors have a ratio of 1:1 (See [Ref.[12] of ArXiv.1512.03385]) . For testing, the network is applied on the image fully-convolutionally."
        ],
        [
          "[Table.10 of ArXiv.1512.03385] compares the localization results. Following (See [Ref.[0] of ArXiv.1512.03385]) , we first perform “oracle” testing using the ground truth class as the classification prediction. VGG’s (See [Ref. [Ref.[0] of ArXiv.1512.03385] of ArXiv.1512.03385]) reports a center-crop error of 33.1% [Table.10 of ArXiv.1512.03385] using ground truth classes. Under the same setting, our RPN method using ResNet-101 net significantly reduces the center-crop error to 13.3%. This comparison demonstrates the excellent performance of our framework. With dense (fully convolutional) and multi-scale testing, our ResNet-101 has an error of 11.7% using ground truth classes. Using ResNet-101 for predicting classes (4.6% top-5 classification error, [Table.9 of ArXiv.1512.03385] ), the top-5 localization error is 14.4%."
        ],
        [
          "The above results are only based on the proposal network (RPN) in Faster R-CNN (See [Ref.[12] of ArXiv.1512.03385]) . One may use the detection network (Fast R-CNN (See [Ref.[11] of ArXiv.1512.03385]) ) in Faster R-CNN to improve the results. But we notice that on this dataset, one image usually contains a single dominate object, and the proposal regions highly overlap with each other and thus have very similar RoI-pooled features. As a result, the image-centric training of Fast R-CNN (See [Ref.[11] of ArXiv.1512.03385]) generates samples of small variations, which may not be desired for stochastic training. Motivated by this, in our current experiment we use the original R-CNN (See [Ref.[9] of ArXiv.1512.03385]) that is RoI-centric, in place of Fast R-CNN."
        ],
        [
          "Our R-CNN implementation is as follows. We apply the per-class RPN trained as above on the training images to predict bounding boxes for the ground truth class. These predicted boxes play a role of class-dependent proposals. For each training image, the highest scored 200 proposals are extracted as training samples to train an R-CNN classifier. The image region is cropped from a proposal, warped to 224$\\times$224 pixels, and fed into the classification network as in R-CNN (See [Ref.[9] of ArXiv.1512.03385]) . The outputs of this network consist of two sibling fc layers for cls and reg , also in a per-class form. This R-CNN network is fine-tuned on the training set using a mini-batch size of 256 in the RoI-centric fashion. For testing, the RPN generates the highest scored 200 proposals for each predicted class, and the R-CNN network is used to update these proposals’ scores and box positions."
        ],
        [
          "This method reduces the top-5 localization error to 10.6% ( [Table.10 of ArXiv.1512.03385] ). This is our single-model result on the validation set. Using an ensemble of networks for both classification and localization, we achieve a top-5 localization error of 9.0% on the test set. This number significantly outperforms the ILSVRC 14 results ( [Table.3 of ArXiv.1512.03385] ), showing a 64% relative reduction of error. This result won the 1st place in the ImageNet localization task in ILSVRC 2015."
        ]
      ]
    }
  ],
  "metadata": {
    "figures_metadata": {
      "LABEL:fig:teaser": "Figure 1 Training error (left) and test error (right) on CIFAR-10 with 20-layer and 56-layer “plain” networks. The deeper network has higher training error, and thus test error. Similar phenomena on ImageNet is presented in [Figure.3 of ArXiv.1512.03385] .",
      "LABEL:fig:block": "Figure 2 Residual learning: a building block.",
      "LABEL:fig:arch": "Figure 3 Example network architectures for ImageNet. **Left** : the VGG-19 model (See [Ref.[0] of ArXiv.1512.03385]) (19.6 billion FLOPs) as a reference. **Middle** : a plain network with 34 parameter layers (3.6 billion FLOPs). **Right** : a residual network with 34 parameter layers (3.6 billion FLOPs). The dotted shortcuts increase dimensions. ** [Table.7 of ArXiv.1512.03385] ** shows more details and other variants.",
      "LABEL:fig:imagenet": "Figure 4 Training on **ImageNet** . Thin curves denote training error, and bold curves denote validation error of the center crops. Left: plain networks of 18 and 34 layers. Right: ResNets of 18 and 34 layers. In this plot, the residual networks have no extra parameter compared to their plain counterparts.",
      "LABEL:fig:block_deeper": "Figure 5 A deeper residual function $\\mathcal{F}$ for ImageNet. Left: a building block (on 56$\\times$56 feature maps) as in [Figure.2 of ArXiv.1512.03385] for ResNet-34. Right: a “bottleneck” building block for ResNet-50/101/152.",
      "LABEL:fig:cifar": "Figure 6 Training on **CIFAR-10** . Dashed lines denote training error, and bold lines denote testing error. **Left** : plain networks. The error of plain-110 is higher than 60% and not displayed. **Middle** : ResNets. **Right** : ResNets with 110 and 1202 layers.",
      "LABEL:fig:std": "Figure 7 Standard deviations (std) of layer responses on CIFAR-10. The responses are the outputs of each 3$\\times$3 layer, after BN and before nonlinearity. **Top** : the layers are shown in their original order. **Bottom** : the responses are ranked in descending order."
    },
    "tables_metadata": {},
    "bibitem_ref_metadata": {
      "Simonyan2015": "K. Simonyan and A. Zisserman. Very deep convolutional networks for large-scale image recognition. In ICLR , 2015.",
      "LeCun1989": "Y. LeCun, B. Boser, J. S. Denker, D. Henderson, R. E. Howard, W. Hubbard, and L. D. Jackel. Backpropagation applied to handwritten zip code recognition. Neural computation , 1989.",
      "Krizhevsky2012": "A. Krizhevsky, I. Sutskever, and G. Hinton. Imagenet classification with deep convolutional neural networks. In NIPS , 2012.",
      "Zeiler2014": "M. D. Zeiler and R. Fergus. Visualizing and understanding convolutional neural networks. In ECCV , 2014.",
      "Sermanet2014": "P. Sermanet, D. Eigen, X. Zhang, M. Mathieu, R. Fergus, and Y. LeCun. Overfeat: Integrated recognition, localization and detection using convolutional networks. In ICLR , 2014.",
      "Szegedy2015": "C. Szegedy, W. Liu, Y. Jia, P. Sermanet, S. Reed, D. Anguelov, D. Erhan, V. Vanhoucke, and A. Rabinovich. Going deeper with convolutions. In CVPR , 2015.",
      "He2015": "K. He, X. Zhang, S. Ren, and J. Sun. Delving deep into rectifiers: Surpassing human-level performance on imagenet classification. In ICCV , 2015.",
      "Ioffe2015": "S. Ioffe and C. Szegedy. Batch normalization: Accelerating deep network training by reducing internal covariate shift. In ICML , 2015.",
      "Russakovsky2014": "O. Russakovsky, J. Deng, H. Su, J. Krause, S. Satheesh, S. Ma, Z. Huang, A. Karpathy, A. Khosla, M. Bernstein, et al. Imagenet large scale visual recognition challenge. arXiv:1409.0575 , 2014.",
      "Girshick2014": "R. Girshick, J. Donahue, T. Darrell, and J. Malik. Rich feature hierarchies for accurate object detection and semantic segmentation. In CVPR , 2014.",
      "He2014": "K. He, X. Zhang, S. Ren, and J. Sun. Spatial pyramid pooling in deep convolutional networks for visual recognition. In ECCV , 2014.",
      "Girshick2015": "R. Girshick. Fast R-CNN. In ICCV , 2015.",
      "Ren2015": "S. Ren, K. He, R. Girshick, and J. Sun. Faster R-CNN: Towards real-time object detection with region proposal networks. In NIPS , 2015.",
      "Long2015": "J. Long, E. Shelhamer, and T. Darrell. Fully convolutional networks for semantic segmentation. In CVPR , 2015.",
      "Bengio1994": "Y. Bengio, P. Simard, and P. Frasconi. Learning long-term dependencies with gradient descent is difficult. IEEE Transactions on Neural Networks , 5(2):157–166, 1994.",
      "Glorot2010": "X. Glorot and Y. Bengio. Understanding the difficulty of training deep feedforward neural networks. In AISTATS , 2010.",
      "LeCun1998": "Y. LeCun, L. Bottou, G. B. Orr, and K.-R. Müller. Efficient backprop. In Neural Networks: Tricks of the Trade , pages 9–50. Springer, 1998.",
      "Saxe2013": "A. M. Saxe, J. L. McClelland, and S. Ganguli. Exact solutions to the nonlinear dynamics of learning in deep linear neural networks. arXiv:1312.6120 , 2013.",
      "He2015a": "K. He and J. Sun. Convolutional neural networks at constrained time cost. In CVPR , 2015.",
      "Srivastava2015": "R. K. Srivastava, K. Greff, and J. Schmidhuber. Highway networks. arXiv:1505.00387 , 2015.",
      "Bishop1995": "C. M. Bishop. Neural networks for pattern recognition . Oxford university press, 1995.",
      "Ripley1996": "B. D. Ripley. Pattern recognition and neural networks . Cambridge university press, 1996.",
      "Venables1999": "W. Venables and B. Ripley. Modern applied statistics with s-plus. 1999.",
      "Jia2014": "Y. Jia, E. Shelhamer, J. Donahue, S. Karayev, J. Long, R. Girshick, S. Guadarrama, and T. Darrell. Caffe: Convolutional architecture for fast feature embedding. arXiv:1408.5093 , 2014.",
      "Krizhevsky2009": "A. Krizhevsky. Learning multiple layers of features from tiny images. Tech Report , 2009.",
      "Jegou2012": "H. Jegou, F. Perronnin, M. Douze, J. Sanchez, P. Perez, and C. Schmid. Aggregating local image descriptors into compact codes. TPAMI , 2012.",
      "Perronnin2007": "F. Perronnin and C. Dance. Fisher kernels on visual vocabularies for image categorization. In CVPR , 2007.",
      "Chatfield2011": "K. Chatfield, V. Lempitsky, A. Vedaldi, and A. Zisserman. The devil is in the details: an evaluation of recent feature encoding methods. In BMVC , 2011.",
      "Vedaldi2008": "A. Vedaldi and B. Fulkerson. VLFeat: An open and portable library of computer vision algorithms, 2008.",
      "Jegou2011": "H. Jegou, M. Douze, and C. Schmid. Product quantization for nearest neighbor search. TPAMI , 33, 2011.",
      "Briggs2000": "W. L. Briggs, S. F. McCormick, et al. A Multigrid Tutorial . Siam, 2000.",
      "Szeliski1990": "R. Szeliski. Fast surface interpolation using hierarchical basis functions. TPAMI , 1990.",
      "Szeliski2006": "R. Szeliski. Locally adapted hierarchical basis preconditioning. In SIGGRAPH , 2006.",
      "Lee2014": "C.-Y. Lee, S. Xie, P. Gallagher, Z. Zhang, and Z. Tu. Deeply-supervised nets. arXiv:1409.5185 , 2014.",
      "Schraudolph1998": "N. N. Schraudolph. Centering neural network gradient factors. In Neural Networks: Tricks of the Trade , pages 207–226. Springer, 1998.",
      "Schraudolph1998a": "N. N. Schraudolph. Accelerated gradient descent by factor-centering decomposition. Technical report, 1998.",
      "Raiko2012": "T. Raiko, H. Valpola, and Y. LeCun. Deep learning made easier by linear transformations in perceptrons. In AISTATS , 2012.",
      "Vatanen2013": "T. Vatanen, T. Raiko, H. Valpola, and Y. LeCun. Pushing stochastic gradient towards second-order methods–backpropagation learning with transformations in nonlinearities. In Neural Information Processing , 2013.",
      "Srivastava2015a": "R. K. Srivastava, K. Greff, and J. Schmidhuber. Training very deep networks. 1507.06228 , 2015.",
      "Hochreiter1997": "S. Hochreiter and J. Schmidhuber. Long short-term memory. Neural computation , 9(8):1735–1780, 1997.",
      "Montufar2014": "G. Montúfar, R. Pascanu, K. Cho, and Y. Bengio. On the number of linear regions of deep neural networks. In NIPS , 2014.",
      "Nair2010": "V. Nair and G. E. Hinton. Rectified linear units improve restricted boltzmann machines. In ICML , 2010.",
      "Hinton2012": "G. E. Hinton, N. Srivastava, A. Krizhevsky, I. Sutskever, and R. R. Salakhutdinov. Improving neural networks by preventing co-adaptation of feature detectors. arXiv:1207.0580 , 2012.",
      "Romero2015": "A. Romero, N. Ballas, S. E. Kahou, A. Chassang, C. Gatta, and Y. Bengio. Fitnets: Hints for thin deep nets. In ICLR , 2015.",
      "Goodfellow2013": "I. J. Goodfellow, D. Warde-Farley, M. Mirza, A. Courville, and Y. Bengio. Maxout networks. arXiv:1302.4389 , 2013.",
      "Lin2013": "M. Lin, Q. Chen, and S. Yan. Network in network. arXiv:1312.4400 , 2013.",
      "Everingham2010": "M. Everingham, L. Van Gool, C. K. Williams, J. Winn, and A. Zisserman. The Pascal Visual Object Classes (VOC) Challenge. IJCV , pages 303–338, 2010.",
      "Lin2014": "T.-Y. Lin, M. Maire, S. Belongie, J. Hays, P. Perona, D. Ramanan, P. Dollár, and C. L. Zitnick. Microsoft COCO: Common objects in context. In ECCV . 2014.",
      "Ren2015a": "S. Ren, K. He, R. Girshick, X. Zhang, and J. Sun. Object detection networks on convolutional feature maps. arXiv:1504.06066 , 2015.",
      "Gidaris2015": "S. Gidaris and N. Komodakis. Object detection via a multi-region & semantic segmentation-aware cnn model. In ICCV , 2015."
    }
  },
  "paper_id": "ArXiv.1512.03385",
  "whole_ref_to_labels": {
    "LABEL:fig:teaser": [
      [
        "Figure",
        "0"
      ]
    ],
    "LABEL:fig:block": [
      [
        "Figure",
        "1"
      ]
    ],
    "LABEL:fig:arch": [
      [
        "Figure",
        "2"
      ]
    ],
    "LABEL:fig:imagenet": [
      [
        "Figure",
        "3"
      ]
    ],
    "LABEL:fig:block_deeper": [
      [
        "Figure",
        "4"
      ]
    ],
    "LABEL:fig:cifar": [
      [
        "Figure",
        "5"
      ]
    ],
    "LABEL:fig:std": [
      [
        "Figure",
        "6"
      ]
    ],
    "Simonyan2015": [
      [
        "Reference",
        "0"
      ]
    ],
    "LeCun1989": [
      [
        "Reference",
        "1"
      ]
    ],
    "Krizhevsky2012": [
      [
        "Reference",
        "2"
      ]
    ],
    "Zeiler2014": [
      [
        "Reference",
        "3"
      ]
    ],
    "Sermanet2014": [
      [
        "Reference",
        "4"
      ]
    ],
    "Szegedy2015": [
      [
        "Reference",
        "5"
      ]
    ],
    "He2015": [
      [
        "Reference",
        "6"
      ]
    ],
    "Ioffe2015": [
      [
        "Reference",
        "7"
      ]
    ],
    "Russakovsky2014": [
      [
        "Reference",
        "8"
      ]
    ],
    "Girshick2014": [
      [
        "Reference",
        "9"
      ]
    ],
    "He2014": [
      [
        "Reference",
        "10"
      ]
    ],
    "Girshick2015": [
      [
        "Reference",
        "11"
      ]
    ],
    "Ren2015": [
      [
        "Reference",
        "12"
      ]
    ],
    "Long2015": [
      [
        "Reference",
        "13"
      ]
    ],
    "Bengio1994": [
      [
        "Reference",
        "14"
      ]
    ],
    "Glorot2010": [
      [
        "Reference",
        "15"
      ]
    ],
    "LeCun1998": [
      [
        "Reference",
        "16"
      ]
    ],
    "Saxe2013": [
      [
        "Reference",
        "17"
      ]
    ],
    "He2015a": [
      [
        "Reference",
        "18"
      ]
    ],
    "Srivastava2015": [
      [
        "Reference",
        "19"
      ]
    ],
    "Bishop1995": [
      [
        "Reference",
        "20"
      ]
    ],
    "Ripley1996": [
      [
        "Reference",
        "21"
      ]
    ],
    "Venables1999": [
      [
        "Reference",
        "22"
      ]
    ],
    "Jia2014": [
      [
        "Reference",
        "23"
      ]
    ],
    "Krizhevsky2009": [
      [
        "Reference",
        "24"
      ]
    ],
    "Jegou2012": [
      [
        "Reference",
        "25"
      ]
    ],
    "Perronnin2007": [
      [
        "Reference",
        "26"
      ]
    ],
    "Chatfield2011": [
      [
        "Reference",
        "27"
      ]
    ],
    "Vedaldi2008": [
      [
        "Reference",
        "28"
      ]
    ],
    "Jegou2011": [
      [
        "Reference",
        "29"
      ]
    ],
    "Briggs2000": [
      [
        "Reference",
        "30"
      ]
    ],
    "Szeliski1990": [
      [
        "Reference",
        "31"
      ]
    ],
    "Szeliski2006": [
      [
        "Reference",
        "32"
      ]
    ],
    "Lee2014": [
      [
        "Reference",
        "33"
      ]
    ],
    "Schraudolph1998": [
      [
        "Reference",
        "34"
      ]
    ],
    "Schraudolph1998a": [
      [
        "Reference",
        "35"
      ]
    ],
    "Raiko2012": [
      [
        "Reference",
        "36"
      ]
    ],
    "Vatanen2013": [
      [
        "Reference",
        "37"
      ]
    ],
    "Srivastava2015a": [
      [
        "Reference",
        "38"
      ]
    ],
    "Hochreiter1997": [
      [
        "Reference",
        "39"
      ]
    ],
    "Montufar2014": [
      [
        "Reference",
        "40"
      ]
    ],
    "Nair2010": [
      [
        "Reference",
        "41"
      ]
    ],
    "Hinton2012": [
      [
        "Reference",
        "42"
      ]
    ],
    "Romero2015": [
      [
        "Reference",
        "43"
      ]
    ],
    "Goodfellow2013": [
      [
        "Reference",
        "44"
      ]
    ],
    "Lin2013": [
      [
        "Reference",
        "45"
      ]
    ],
    "Everingham2010": [
      [
        "Reference",
        "46"
      ]
    ],
    "Lin2014": [
      [
        "Reference",
        "47"
      ]
    ],
    "Ren2015a": [
      [
        "Reference",
        "48"
      ]
    ],
    "Gidaris2015": [
      [
        "Reference",
        "49"
      ]
    ],
    "LABEL:eq:identity": [
      [
        "Equation",
        "0"
      ]
    ],
    "LABEL:eq:transform": [
      [
        "Equation",
        "1"
      ]
    ],
    "LABEL:tab:plain_vs_shortcut": [
      [
        "Missing",
        "0"
      ]
    ],
    "LABEL:tab:imagenet_det": [
      [
        "Missing",
        "1"
      ]
    ],
    "LABEL:tab:ensemble": [
      [
        "Missing",
        "2"
      ]
    ],
    "LABEL:tab:localization_all": [
      [
        "Missing",
        "3"
      ]
    ],
    "LABEL:tab:detection_voc": [
      [
        "Missing",
        "4"
      ]
    ],
    "LABEL:tab:10crop": [
      [
        "Missing",
        "5"
      ]
    ],
    "LABEL:tab:voc12_all": [
      [
        "Missing",
        "6"
      ]
    ],
    "LABEL:tab:arch": [
      [
        "Missing",
        "7"
      ]
    ],
    "LABEL:tab:detection_coco": [
      [
        "Missing",
        "8"
      ]
    ],
    "LABEL:tab:single": [
      [
        "Missing",
        "9"
      ]
    ],
    "LABEL:tab:localization": [
      [
        "Missing",
        "10"
      ]
    ],
    "LABEL:tab:detection_coco_improve": [
      [
        "Missing",
        "11"
      ]
    ],
    "LABEL:tab:cifar": [
      [
        "Missing",
        "12"
      ]
    ],
    "LABEL:tab:voc07_all": [
      [
        "Missing",
        "13"
      ]
    ],
    "LABEL:sec:intro": [
      [
        "Section",
        "0"
      ]
    ],
    "LABEL:sec:exp": [
      [
        "Section",
        "1"
      ]
    ],
    "LABEL:sec:motivation": [
      [
        "Subsection",
        "0"
      ]
    ],
    "LABEL:sec:impl": [
      [
        "Subsection",
        "1"
      ]
    ],
    "LABEL:sec:imagenet": [
      [
        "Subsection",
        "2"
      ]
    ],
    "LABEL:sec:appendix_localization": [
      [
        "Appendix",
        "0"
      ]
    ]
  },
  "missing_citation_labels": {
    "LABEL:tab:plain_vs_shortcut": "MissingCite_0",
    "LABEL:tab:imagenet_det": "MissingCite_1",
    "LABEL:tab:ensemble": "MissingCite_2",
    "LABEL:tab:localization_all": "MissingCite_3",
    "LABEL:tab:detection_voc": "MissingCite_4",
    "LABEL:tab:10crop": "MissingCite_5",
    "LABEL:tab:voc12_all": "MissingCite_6",
    "LABEL:tab:arch": "MissingCite_7",
    "LABEL:tab:detection_coco": "MissingCite_8",
    "LABEL:tab:single": "MissingCite_9",
    "LABEL:tab:localization": "MissingCite_10",
    "LABEL:tab:detection_coco_improve": "MissingCite_11",
    "LABEL:tab:cifar": "MissingCite_12",
    "LABEL:tab:voc07_all": "MissingCite_13"
  }
}